<?php
/**
 * 错误提示消息
 *
 * @author wuzhihua
 */
namespace Business;

final class ErrorconstModel {
    
    const ERROR_MSG =[
            10000 => '消息未定义',
            23200 => '注册成功',
            23201 => '请输入账号和密码',
            23202 => '请输入正确的手机号',
            23203 => '账号或密码错误',
            23204 => '请输入正确的手机号',
            23205 => '非法操作',
            23206 => '注册过程出问题了，请重新注册或联系客服',
            23207 => '操作太频繁了, 请休息下吧',
            23208 => '短信验证码刷新太快了, 休息下吧',
            23209 => '短信发送频繁, 休息下吧',
            //注册
            23210 => '请输入正确的手机号',
            23211 => '请输入正确的电子邮箱',
            23212 => '密码必须大于6位',
            23214 => '短信验证码不正确',
            23213 => '该手机号已被注册',
            23215 => '该手机号尚未注册',
            //订单状态
            24201=>'订单不存在',
        ];
           
}
